In [2]:
import numpy as np

import pandas as pd

from pandas import Series, DataFrame

# Summary

- See the columns names
- See index
- See column with a specific name
- Replace a value in the entire column
- Subset dataframe with column names + non existing
- Replace values in the Dataframe using a seies --> matching by index
- From DICTIONARY TO PANDAS

data.iloc[row selction, column_selection]   
- case-1    integer list [1,2,3]    
- case-2    slice of rows [4:7]    
- case-3    single value 1    
    
data.loc[row selction, column_selection]   
- case-4    index/label value , column name    
- case-5    list of labels    , list of clumn names    
- case-6    logic on the row values , slice of columns

# Development

In [ ]:
#Now we'll learn DataFrames

#Let's get some data to play with. How about the NFL?
import webbrowser
website = 'http://en.wikipedia.org/wiki/NFL_win-loss_records'
webbrowser.open(website)

In [ ]:
# This was the origna surce of data
# nfl_frame = pd.read_clipboard()
filepath = r'C:\Users\mp53\udemy-viz\textdata_in_mp003.csv'
nfl_frame = pd.read_csv(filepath, sep=',')

In [ ]:
# Show the dataframe just imported
nfl_frame

In [ ]:
# See the columns names
nfl_frame.columns

In [ ]:
# See index
nfl_frame.index

In [ ]:
# See column with a specific name
nfl_frame['Team']
print(nfl_frame)
# Replace a value in the entire column
nfl_frame['Division'] = 'Antony'

In [ ]:
# Subset dataframe with column names + non existing
DataFrame(nfl_frame,columns=['Team','GP','Won','Luingi'])

In [ ]:
# Replace values in the Dataframe using a seies --> matching by index
to_replace = Series(["replace1","replace2"],index=[1,3])
print(to_replace)

nfl_frame['Luingi'] = to_replace
nfl_frame

In [ ]:
nfl_frame.head()
nfl_frame.tail()

In [32]:
## From DICTIONARY TO PANDAS
data = {'City': ['SF','LA','NYC'], 'Population':[8300000,3000000,10000000]}
data_df = DataFrame(data)
data_df

  City  Population
0   SF     8300000
1   LA     3000000
2  NYC    10000000

In [31]:
print('default')
print(data_df.to_dict())
print('list')
print(data_df.to_dict('list'))
print('series')
print(data_df.to_dict('series'))
print('split')
print(data_df.to_dict('split'))
print('records')
print(data_df.to_dict('records'))
print('index')
print(data_df.to_dict('index'))

default
{'City': {0: 'SF', 1: 'LA', 2: 'NYC'}, 'Population': {0: 8300000, 1: 3000000, 2: 10000000}}
list
{'City': ['SF', 'LA', 'NYC'], 'Population': [8300000, 3000000, 10000000]}
series
{'City': 0     SF
1     LA
2    NYC
Name: City, dtype: object, 'Population': 0     8300000
1     3000000
2    10000000
Name: Population, dtype: int64}
split
{'index': [0, 1, 2], 'columns': ['City', 'Population'], 'data': [['SF', 8300000], ['LA', 3000000], ['NYC', 10000000]]}
records
[{'City': 'SF', 'Population': 8300000}, {'City': 'LA', 'Population': 3000000}, {'City': 'NYC', 'Population': 10000000}]
index
{0: {'City': 'SF', 'Population': 8300000}, 1: {'City': 'LA', 'Population': 3000000}, 2: {'City': 'NYC', 'Population': 10000000}}

In [ ]:
nfl_frame.columns

# iloc , loc

**iloc** Selecting data by row numbers (.iloc)   
**loc** Selecting data by label or by a conditional statment (.loc)

data.iloc[row selction, column_selection]   
case-1    integer list [1,2,3]    
case-2    slice of rows [4:7]    
case-3    single value 1    
    
data.loc[row selction, column_selection]   
case-4    index/label value , column name    
case-5    list of labels    , list of clumn names    
case-6    logic on the row values , slice of columns

In [ ]:
# iloc

# Case-1
case = nfl_frame.iloc[[0,1,2],[2,3,4]]
print(case)
# Case-2
# NB with this method the right-sode index must be one number higher
case = nfl_frame.iloc[0:3,2:5]
print(case)
# Case-3
case = nfl_frame.iloc[2,2]
print(case)

In [ ]:
print(type(nfl_frame.iloc[1])) # Select one row
print(type(nfl_frame.iloc[[1]])) # Select one row as DATA FRAME
print(type(nfl_frame.iloc[0:2,])) # Select two rows
print(type(nfl_frame.iloc[:,1])) # Select one column
print(type(nfl_frame.iloc[:,[1]])) # Select one column as DATAFRAME 
print(type(nfl_frame.iloc[0:2,0:3])) # Select multiple row columns

In [ ]:
# Case-4
case = nfl_frame.loc[:,['Division']] # as Dataframe
print(type(case))
case = nfl_frame.loc[:,'Division'] # as Series
print(type(case))
case = nfl_frame.loc[0,:] # as Series
print(case)

# Case-5
case = nfl_frame.loc[[0]]
print(type(case))
print(case)

case = nfl_frame.loc[0:3,['Division','Won']]
print(type(case))
print(case)

# Case-6
case = nfl_frame.loc[nfl_frame['Division']=='NFC North',['Won','Division']]
print(case)

# Exercise

In [9]:
import pandas as pd
import random
 
# read the data from the downloaded CSV file.
data = pd.read_csv('https://s3-eu-west-1.amazonaws.com/shanebucket/downloads/uk-500.csv')
# set a numeric id for use as an index for examples.
data['id'] = [random.randint(0,1000) for x in range(data.shape[0])]
 
data.head(5)

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web,id
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk,111
1,Evan,Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk,437
2,France,Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk,940
3,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk,944
4,Tyisha,Veness,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk,904

- See the columns names
- See index
- See column with a specific name
- Replace a value in the entire column
- Subset dataframe with column names + non existing
- Replace values in the Dataframe using a series --> matching by index
- From DICTIONARY TO PANDAS
- From PANDAS to DICTIONARIY (empty, list, series, split, records, index)

data.iloc[row selction, column_selection]   
- case-1    integer list [1,2,3]    
- case-2    slice of rows [4:7]    
- case-3    single value 1    
    
data.loc[row selction, column_selection]   
- case-4    index/label value , column name    
- case-5    list of labels    , list of clumn names    
- case-6    logic on the row values , slice of columns

Index(['first_name', 'last_name', 'company_name', 'address', 'city', 'county',
       'postal', 'phone1', 'phone2', 'email', 'web', 'id', 'email2', 'santo'],
      dtype='object')

,first_name,last_name,company_name,address,city,county,postal,phone1,phone2,email,web,id,email2,santo
0,Aleshia,Tomkiewicz,Alan D Rosenburg Cpa Pc,14 Taylor St,St. Stephens Ward,Kent,CT2 7PP,01835-703597,01944-369967,atomkiewicz@hotmail.com,http://www.alandrosenburgcpapc.co.uk,111,luiggi,johnson
1,Evan,Zigomalas,Cap Gemini America,5 Binney St,Abbey Ward,Buckinghamshire,HP11 2AX,01937-864715,01714-737668,evan.zigomalas@gmail.com,http://www.capgeminiamerica.co.uk,437,luiggi,jane
2,France,Andrade,"Elliott, John W Esq",8 Moor Place,East Southbourne and Tuckton W,Bournemouth,BH6 3BE,01347-368222,01935-821636,france.andrade@hotmail.com,http://www.elliottjohnwesq.co.uk,940,luiggi,July
3,Ulysses,Mcwalters,"Mcmahan, Ben L",505 Exeter Rd,Hawerby cum Beesby,Lincolnshire,DN36 5RP,01912-771311,01302-601380,ulysses@hotmail.com,http://www.mcmahanbenl.co.uk,944,luiggi,NaN
4,Tyisha,Veness,Champagne Room,5396 Forth Street,Greets Green and Lyng Ward,West Midlands,B70 9DT,01547-429341,01290-367248,tyisha.veness@hotmail.com,http://www.champagneroom.co.uk,904,luiggi,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
495,Avery,Veit,Plaza Gourmet Delicatessen,9166 Devon St #905,Knightsbridge and Belgravia Wa,Greater London,SW1W 8JY,01748-625058,01369-185737,avery@veit.co.uk,http://www.plazagourmetdelicatessen.co.uk,491,luiggi,NaN
496,Reid,Euresti,"Fitzgerald, Edward J",70 Foster St,Inverness Ness-Side Ward,Highland,IV2 6WT,01916-963261,01370-319414,reuresti@euresti.co.uk,http://www.fitzgeraldedwardj.co.uk,882,luiggi,NaN
497,Charlette,Brenning,Furey & Associates,714 Fonthill Rd,Darton West Ward,South Yorkshire,S75 5EJ,01888-152110,01301-312487,cbrenning@brenning.co.uk,http://www.fureyassociates.co.uk,314,luiggi,NaN
498,Celestina,Keeny,Bfg Federal Credit Union,9 Milton St,Consett North ED,County Durham,DH8 5LP,01877-379681,01600-463475,celestina_keeny@gmail.com,http://www.bfgfederalcreditunion.co.uk,858,luiggi,NaN
499,Mi,Richan,Nelson Wright Haworth Golf Crs,6 Norwood Grove,Tanworth-in-Arden,Warwickshire,B94 5RZ,01451-785624,01202-738406,mi@hotmail.com,http://www.nelsonwrighthaworthgolfcrs.co.uk,843,luiggi,NaN

In [ ]:
# data.iloc[0] # first row of data frame (Aleshia Tomkiewicz) - Note a Series data type output.
# data.iloc[1] # second row of data frame (Evan Zigomalas)
# data.iloc[-1] # last row of data frame (Mi Richan)
# # Columns:
data.iloc[:,0] # first column of data frame (first_name)
# data.iloc[:,1] # second column of data frame (last_name)
# data.iloc[:,-1] # last column of data frame (id)

In [ ]:
# Multiple row and column selections using iloc and DataFrame
data.iloc[0:5] # first five rows of dataframe
data.iloc[:, 0:2] # first two columns of data frame with all rows
data.iloc[0:5, 5:8] # first 5 rows and 5th, 6th, 7th columns of data frame (county -> phone1).